# EnergyAnalysisDetailModelOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisDetailModelOptions Constructor
EnergyAnalysisDetailModelOptions Class See Also
---
Constructs default options for energy analysis detailed model creation.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public EnergyAnalysisDetailModelOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
EnergyAnalysisDetailModelOptions()
```

# See Also
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace